# 1- Вычислить число c заданной точностью d. 
# Число Пи не просто обрезать с math.pi, а вычислить, используя формулы: 
# Нилаканта, ряды Тейлора, серию Ньютона или серию Чудновских.

# Пример:

# - при d = 0.001, π = 3.141.    10^(-10)≤ d ≤10^-1
# 3,1415926535
# Ряд Нилаканта
# π = 3 + 4/(2*3*4) — 4/(4*5*6) + 4/(6*7*8) — 4/(8*9*10) + 4/(10*11*12) — 4/(12*13*14) 

from decimal import Decimal

def Pi(d):
    sum = 3
    count = 2
    oper = 0
    e = 0
    while oper != 800:
        sum += Decimal(4/(count*(count+1)*(count+2)))
        count +=2
        sum = sum - (Decimal(4/(count*(count+1)*(count+2))))
        count +=2
        oper+=1
    while d != int(d):
        d = d*10
        e +=1
    return int(sum*10**e)/10**e    

print(Pi(0.0000000001))





